# specify a directory to install:
cask_args appdir: '/Applications'

# install from repos:
tap "homebrew/core"
tap "thoughtbot/formulae"
tap "homebrew/bundle"
tap "caskroom/cask"

#install packages:
brew "fish"
brew "gettext"
brew "git"
brew "libidn2"
brew "openssl"
brew "pandoc"
brew "sqlite"
brew "python3", link: false
brew "vim"
brew "wget"
brew "zsh"

# Casks:
cask "xquartz"
cask 'google-chrome'
cask 'dropbox'
cask 'alfred'
cask 'slack'
cask 'spotify'
cask '1password'
cask 'iterm2'
cask 'bear'
cask 'google-photos-backup-and-sync' 
cask 'karabiner-elements'
cask 'spark'
cask 'tunnelbear'
cask 'microsoft-office'
cask 'remembear'
cask 'caffeine'
cask 'wordpresscom'
cask 'cleanmymac'
cask 'bartender'



